In [1]:
%load_ext sql
%sql sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

In [2]:
%%sql

/*What is Prof. Huntleys InID in our database?*/

SELECT * 
FROM INSTRUCTOR
WHERE NAME LIKE '%Huntley%';

 * sqlite:///CourseDataWarehouse.db
Done.

[(274, 'Christopher L.  Huntley')]

# How many cat ids does not work  #

In [3]:
%%sql

--How many Catalog ID classes are 4 credits?-- 

SELECT COUNT(CatID) 
FROM CATALOG
WHERE Credits = '4 Credits' 
LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
Done.

[(55,)]

In [4]:
%%sql

--How many insructors do we have in our database?-- 

SELECT COUNT(InID) 
FROM Instructor 
LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1103,)]

In [5]:
%%sql 

--Which DSB classroom has the most class hours scheduled for the Spring 2019 semester?--

SELECT (SUM(strftime('%s',End)-strftime('%s',Start))/60)/60 AS CourseHours, CRN, Location, Term
FROM MEETING
WHERE LOCATION LIKE '%DSB%' AND Term = 'Spring2019'
GROUP BY Location, Term
ORDER BY CourseHours DESC
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(816, 37510, 'DSB 105', 'Spring2019'),
 (644, 37174, 'DSB 111', 'Spring2019'),
 (630, 37512, 'DSB 106', 'Spring2019'),
 (602, 37171, 'DSB 112', 'Spring2019'),
 (582, 37364, 'DSB 109', 'Spring2019'),
 (545, 37079, 'DSB 115', 'Spring2019'),
 (491, 37295, 'DSB 104', 'Spring2019'),
 (473, 37032, 'DSB 108', 'Spring2019'),
 (387, 37257, 'DSB 110A', 'Spring2019'),
 (380, 37366, 'DSB 110B', 'Spring2019')]

In [6]:
%%sql 

--Which professor has taught the most courses per Semester?-- 

SELECT InID, Term, Name, Count(Name) AS CoursesTaught, CatID
FROM Instructor
    JOIN COURSE USING (InID)
GROUP BY InID, Term
ORDER BY CoursesTaught DESC
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(173, 'Fall2017', 'Sonya R.  Huber', 32, 'ENW 0306'),
 (173, 'Spring2016', 'Sonya R.  Huber', 32, 'ENW 0206'),
 (173, 'Fall2015', 'Sonya R.  Huber', 31, 'ENW 0306'),
 (173, 'Fall2016', 'Sonya R.  Huber', 31, 'ENW 0346'),
 (173, 'Spring2017', 'Sonya R.  Huber', 31, 'ENW 0206'),
 (216, 'Spring2015', 'Michael C.  White', 29, 'ENW 0305'),
 (216, 'Fall2014', 'Michael C.  White', 27, 'ENW 0205'),
 (270, 'Fall2014', 'Laura   Nash', 21, 'HR 0202'),
 (635, 'Fall2016', 'Caitlin E.  Hughes', 18, 'MU 0060'),
 (270, 'Spring2015', 'Laura   Nash', 17, 'MU 0065')]

In [7]:
%%sql 

--What is the average class capacity where the capacity is greater than 10 students?--

SELECT AVG(CAP) as AverageCapacity
FROM COURSE
WHERE CAP>10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(22.514390691977955,)]

In [8]:
%%sql 

--Which day of the week overall has the most course hours taught--

SELECT ((SUM(strftime('%s',End)-strftime('%s',Start)))/60)/60 AS CourseHours, Day
FROM MEETING
WHERE DAY <> 'day'
GROUP BY Day
ORDER BY CourseHours DESC;

 * sqlite:///CourseDataWarehouse.db
Done.

[(116562, 'T'),
 (111245, 'R'),
 (108106, 'M'),
 (96924, 'W'),
 (68230, 'F'),
 (7143, 'S'),
 (956, 'U')]

# Huntley Queries!

In [9]:
%%sql 

--Which class has Prof. Huntley taught the most?-- 

SELECT CatID, Title, Name, COUNT(InID) AS TimesTaught
FROM Catalog
    JOIN COURSE USING (CatID)
    JOIN INSTRUCTOR USING (InID)
WHERE NAME LIKE "%Huntley%"
GROUP BY CatID
ORDER BY TimesTaught DESC
LIMIT 3;

 * sqlite:///CourseDataWarehouse.db
Done.

[('OM 0101', 'Operations Management', 'Christopher L.  Huntley', 7),
 ('IS 0240', 'Systems Analysis and Logical Design', 'Christopher L.  Huntley', 4),
 ('IS 0320', 'Systems Design and Implementation', 'Christopher L.  Huntley', 4)]

In [10]:
%%sql 

--How many times has Prof. Huntley taught IS 100-- 

SELECT TERM, Name, CatID
FROM COURSE
    JOIN INSTRUCTOR USING (InID)
    JOIN CATALOG USING (CatID)
WHERE NAME LIKE '%Huntley'AND CatID = "IS 0100";

 * sqlite:///CourseDataWarehouse.db
Done.

[('Fall2014', 'Christopher L.  Huntley', 'IS 0100'),
 ('Fall2015', 'Christopher L.  Huntley', 'IS 0100'),
 ('Fall2015', 'Christopher L.  Huntley', 'IS 0100')]

In [11]:
%%sql 

--Which semester has Prof. Huntley taught the most courses?-- 

SELECT Name, COUNT(CatID) AS AmountOfClassesTaught, Term
FROM COURSE
    JOIN INSTRUCTOR USING (InID)
    JOIN Catalog USING (CatID)
WHERE NAME LIKE "%Huntley%"
GROUP BY Term
ORDER BY AmountOfClassesTaught DESC;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Christopher L.  Huntley', 4, 'Fall2015'),
 ('Christopher L.  Huntley', 4, 'Fall2017'),
 ('Christopher L.  Huntley', 4, 'Spring2017'),
 ('Christopher L.  Huntley', 4, 'Spring2018'),
 ('Christopher L.  Huntley', 3, 'Fall2014'),
 ('Christopher L.  Huntley', 3, 'Spring2016'),
 ('Christopher L.  Huntley', 2, 'Fall2016'),
 ('Christopher L.  Huntley', 2, 'Fall2018'),
 ('Christopher L.  Huntley', 2, 'Spring2019')]

In [12]:
%%sql 

--Which DSB room has Prof. Huntley taught the most in?--

SELECT Name, Location, COUNT(Location) AS NumClassMeetings
FROM MEETING
    JOIN COURSE USING (CRN, Term)
    JOIN INSTRUCTOR USING (InID)
    JOIN Catalog USING (CatID)
WHERE NAME LIKE "%Huntley%"
GROUP BY Location
ORDER BY NumClassMeetings DESC;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Christopher L.  Huntley', 'DSB 106', 108),
 ('Christopher L.  Huntley', 'DSB 110B', 105),
 ('Christopher L.  Huntley', 'DSB 109', 66),
 ('Christopher L.  Huntley', 'DSB 115', 59),
 ('Christopher L.  Huntley', 'DSB 114', 52),
 ('Christopher L.  Huntley', 'DSB 108', 29),
 ('Christopher L.  Huntley', 'DSB 111', 28),
 ('Christopher L.  Huntley', 'DSB 112', 27),
 ('Christopher L.  Huntley', 'DSB 107', 26),
 ('Christopher L.  Huntley', 'DSB 110A', 26),
 ('Christopher L.  Huntley', 'DSB 104', 14),
 ('Christopher L.  Huntley', 'DSB 2109A', 14)]

In [13]:
%%sql 

--Which day does Prof. Huntley historically teach the most?-- 

SELECT ((SUM(strftime('%s',End)-strftime('%s',Start)))/60)/60 AS CourseHours, Day, Name
FROM MEETING
    JOIN COURSE USING (CRN, Term)
    JOIN Instructor USING (InID)
WHERE DAY <> 'day'AND Name LIKE '%Huntley%'
GROUP BY Day
ORDER BY CourseHours DESC;

 * sqlite:///CourseDataWarehouse.db
Done.

[(248, 'W', 'Christopher L.  Huntley'),
 (234, 'T', 'Christopher L.  Huntley'),
 (183, 'R', 'Christopher L.  Huntley'),
 (173, 'M', 'Christopher L.  Huntley'),
 (83, 'F', 'Christopher L.  Huntley'),
 (48, 'S', 'Christopher L.  Huntley')]